First of all, we have to import the libraries that will be needed

In [8]:
import pandas as pd
import numpy as np

Pandas has 2 objects, namely series and data frames

## Object Series

Object Series has one data dimension. It doesn't have a column name because it only has one column. And has an index.

In [65]:
data = [0.25,0.50,0.75,1]

In [66]:
print(data)

[0.25, 0.5, 0.75, 1]

Convert data into series form

In [67]:
data = pd.Series(data) 

#note: Pay attention to writing the Series "S" must be capitalized (if you write it wrong, for example if it is small, there will be an error)

In [68]:
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

Convert from series to array

In [69]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

Displaying index...

The index is in the form of a range, where the start point is inclusive of the range and the stop point is exclusive of the range

In [70]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [71]:
list(range(1,10))

[1, 2, 3, 4, 5, 6, 7, 8, 9]

How to call the data with index

In [72]:
data[2]

0.75

The implicit index is the default index python..

We can define the index, this is called an explicit index, namely an index that is defined..

When defining indexes, the number of indexes must be equal to the number of data..

In [73]:
data = pd.Series([0.25, 0.50, 0.75, 1], index=['a','b','c','d'])

In [74]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [75]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [76]:
data.index

Index(['a', 'b', 'c', 'd'], dtype='object')

We can also Data Slicing

In [82]:
# Indeks eksplisit

data['a']

0.25

This is data selection

Even though we have created an explicit index, we can still call the implicit index.

In [78]:
# Indeks implisit

data[3]

C:\Users\ASUS\AppData\Local\Temp\ipykernel_14612\3846064258.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  data[3]

1.0

When the implicit index and explicit index are the same... When calling the data, it will only use the explicit index, like:

In [79]:
data_2 = pd.Series([0.25, 0.50, 0.75, 1], index=[2,5,3,7])

In [80]:
data_2[2]

0.25

In [81]:
data_2[0]

#There will be an error because if there is a similarity between the implicit index and the explicit index, even just one, it will still not be called or there will be an error

KeyError: 0

Try to do data slicing

In [83]:
data = pd.Series([0.25, 0.50, 0.75, 1], index=['a','b','c','d'])

In [84]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

for example, we will call from data b to data c

In [85]:
data['b':'c'] #explicit index

b    0.50
c    0.75
dtype: float64

But if we slice the implicit index, only the starting point will appear. Because the implicit index is a range

In [ ]:
data[1:2] #indeks implisit (selalu berupa inklusif dikurangi satu atau angka belakangnya tidak dianggap)

# Loc dan ILoc

contoh data yang indeks implisiti dan indeks eksplisit nya ada yang sama

In [ ]:
data_2 = pd.Series([0.25, 0.50, 0.75, 1], index=[2,5,3,7])

In [ ]:
data_2

ketika kita akses satu indeks maka yang muncul adalah indeks eksplisit nya

In [ ]:
data_2[2] #indeks eksplisit : selecting

Ketika kita panggil indeks eksplisit dari indeks 2 sampai 3... nilai yang muncul justru dari indeks implisit nya

In [ ]:
data_2[2:3] #indeks implisit : slicing

ketika indkes eksplisit dan indeks implisit ada yang sama maka akan terjadi inkonsistensi seperti case diatas

untuk mengatasi keadaan inkonsistensi tersebut, maka kita akan gunakan kaidah loc dan iloc

loc adalah untuk memanggil indeks eksplisit

iloc adalah untuk memanggil indeks implisit

In [ ]:
# loc

data_2.loc[3] #selecting indeks eksplisit

In [ ]:
data_2.loc[2:3] #selecting indeks eksplisit

In [ ]:
# Iloc

data_2.iloc[0] #selecting indeks implisit

In [ ]:
data_2.iloc[3] #selecting indeks implisit

In [6]:
# creating simple dictionary

dict_year = {'Salsabilla':2002,
              'Rahma':2003,
              'Sagita':2001,
              'Sheno':2004}

dict_year

{'Salsabilla': 2002, 'Rahma': 2003, 'Sagita': 2001, 'Sheno': 2004}

In [9]:
# creating series for the dictionary

dict_year = pd.Series(dict_year)

dict_year

Salsabilla    2002
Rahma         2003
Sagita        2001
Sheno         2004
dtype: int64

In [12]:
# creating simple dictionary

dict_age = {'Salsabilla':22,
           'Rahma':21,
           'Sagita':23,
           'Sheno':20}

dict_age

{'Salsabilla': 22, 'Rahma': 21, 'Sagita': 23, 'Sheno': 20}

In [13]:
# creating series for the dictionary

dict_age = pd.Series(dict_age)

dict_age

Salsabilla    22
Rahma         21
Sagita        23
Sheno         20
dtype: int64

## Data Frame

is a collection of one or more series arranged in table form with at least one series

In [19]:
Student = pd.DataFrame({'Year':dict_year,'Age':dict_age}) #Pay attention when writing the DataFrame. 'D' and 'F' must be capitalized

In [20]:
Student

            Year  Age
Salsabilla  2002   22
Rahma       2003   21
Sagita      2001   23
Sheno       2004   20

In [21]:
#bisa juga memanggil satu kolom saja

Student['Age']

Salsabilla    22
Rahma         21
Sagita        23
Sheno         20
Name: Age, dtype: int64

In [24]:
#dapat juga memanggil satu kolom dan value untuk melihat lebih spesifik

Student['Year']['Salsabilla']

2002

Can also call with dot, however...

When calling data with the dot Age syntax it will appear as below:

In [30]:
Student.Age

Salsabilla    22
Rahma         21
Sagita        23
Sheno         20
Name: Age, dtype: int64

This can arise because just one word, if there are 2 words with spaces, cannot be called in this way

So it is safer to call data with the example syntax name_df[name_columns]

In [32]:
Student['Age']

Salsabilla    22
Rahma         21
Sagita        23
Sheno         20
Name: Age, dtype: int64

We can also change the Data Frame column names if there is a need to change them, by:

In [34]:
Student = pd.DataFrame({'Birth Year':dict_year,'Age':dict_age})

In [38]:
Student

            Birth Year  Age
Salsabilla        2002   22
Rahma             2003   21
Sagita            2001   23
Sheno             2004   20

In [39]:
Student['Birth Year']

Salsabilla    2002
Rahma         2003
Sagita        2001
Sheno         2004
Name: Birth Year, dtype: int64

Can also Slicing Index

In [40]:
Student['Birth Year']['Rahma':'Sheno'] #Explicit Index

Rahma     2003
Sagita    2001
Sheno     2004
Name: Birth Year, dtype: int64

In [42]:
Student['Age'].iloc[0:3] #implicit index using iloc

Salsabilla    22
Rahma         21
Sagita        23
Name: Age, dtype: int64

## Load CSV Dataset

To load a CSV dataset in Python, you typically use the pandas library, which provides a simple and powerful data manipulation and analysis toolset. But dont forget to make sure place the dataset in same folder with the notebook.

In [1]:
#Basically, this is the syntax to load a dataset, but don't forget to import and run pandas first

df = pd.read_csv('name_dataset.csv')

NameError: name 'pd' is not defined

In [44]:
# example we have dataset csv titanic, we want to load that datase

df = pd.read_csv('Titanic.csv')

In [45]:
#Look at the data above

df.head()

#By default, if the parameters are not filled in, it will display the top 5 data, but you can also fill in the parameters freely according to your needs.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [46]:
#Look data info

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [47]:
#Viewing the number of non-null values in the data.

df.notnull().sum()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [48]:
#Viewing the number of null values in the data.

df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [49]:
#Viewing from the bottom of the data.

df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [50]:
#Viewing the number of rows and columns.

df.shape

(891, 12)

In [51]:
#Viewing columns.

df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [52]:
#Viewing the index.

df.index

RangeIndex(start=0, stop=891, step=1)

In [53]:
#Displaying information from numerical columns.

df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [54]:
#For example, displaying the average of the Age column.

df['Age'].mean()

29.69911764705882

In [55]:
#For example, displaying the median of the Age column.

df['Age'].median()

28.0

In [56]:
#For example, displaying the mode of the Age column.

df['Age'].mode()[0]

24.0

In [57]:
#For example, displaying the minimum value of the Age column.

df['Age'].min()

0.42

In [58]:
#or example, displaying the maximum value of the Age column.

df['Age'].max()

80.0

In [59]:
#For example, viewing the mean of the Age column.

df.Age.mean() 

#It should use a dot because it's only one word. If there's a space, there should be brackets, but it's safer to use brackets even if it's just one word.

29.69911764705882

In [60]:
#For example, checking for NaN in the Age column

df[df['Age'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [61]:
#Then masking it to observe NaN in the Age column

[df['Age'].isnull()]

#It displays the entire Age column data but only as true or false

[0      False
 1      False
 2      False
 3      False
 4      False
        ...
 886    False
 887    False
 888     True
 889    False
 890    False
 Name: Age, Length: 891, dtype: bool]

In [62]:
#For example, observing unique data from the Sex column.

df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [63]:
#For example, observing unique data from the Pclass column.

df['Pclass'].unique()

array([3, 1, 2], dtype=int64)

In [64]:
#For example, checking the count of unique entries in the Sex column.

df.Sex.nunique()

2